classdef AstroConstants
   properties (Constant)
%%定义常数
k = 0.01720209895 %高斯引力常数
c = 299792458     %光速,ms-1

%%基础常数
tA = 499.0047838061 %一个天文单位的光行时间,s
ae = 6378136.6      %地球赤道半径,m
J2 = 0.0010826359  %地球动力学形状因子
GM = 3.986004418e14 %地心引力常数,m3s-2
G = 6.673e-11 %引力常数,m3kg-1s-2
m = 0.0123000383 %月亮与地球质量比
p = 5028.796195 %黄经总岁差（历元2000.0）,″/儒略世纪
e0 = 84381.406 %黄赤交角（历元2000.0），″

%%导出常数
A = 1.49597870691e11 %一个天文单位的长度，m
pQ = 8.794144 %太阳视差，″
kQ = 20.49552 %光行差常数（历元2000.0），″
f = 0.00335281 %地球扁率
GS = 1.32712442076e20 %日心引力常数，m3s-2
S = 1.9888e30 %太阳质量，kg
   end
end